## Problem Statement

#### Sales management has gained importance to meet increasing competition and the need for improved methods of distribution to reduce cost and to increase profits. Sales management today is the most important function in a commercial and business enterprise. 
### Do ETL : Extract-Transform-Load some Amazon dataset and find for me
#### Sales-trend -> month wise , year wise , yearly_month wise
#### Find key metrics and factors and show the meaningful relationships between attributes.

## Approaches


#### Python, R, Tableau, Power BI or you can use any tools and techniques as per your convenience. We would appreciate your valid imagination in finding solutions

## Importing the libraries

In [1]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd
import numpy as np

## Reading the dataset

In [2]:
sales_data = pd.read_csv('./dataset/Amazon Sales Records.csv')
sales_data.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,05-28-2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,08-22-2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,05-02-2014,341417157,05-08-2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,06-20-2014,514321792,07-05-2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,02-01-2013,115456712,02-06-2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

## Analysing Basics of dataset

In [3]:
sales_data.shape

(100, 14)

#### It is founded that the given dataset contains 100 rows and 14 columns

In [4]:
sales_data.columns

Index(['Region', 'Country', 'Item Type', 'Sales Channel', 'Order Priority',
       'Order Date', 'Order ID', 'Ship Date', 'Units Sold', 'Unit Price',
       'Unit Cost', 'Total Revenue', 'Total Cost', 'Total Profit'],
      dtype='object')

In [5]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Region          100 non-null    object
 1   Country         100 non-null    object
 2   Item Type       100 non-null    object
 3   Sales Channel   100 non-null    object
 4   Order Priority  100 non-null    object
 5   Order Date      100 non-null    object
 6   Order ID        100 non-null    int64
 7   Ship Date       100 non-null    object
 8   Units Sold      100 non-null    int64
 9   Unit Price      100 non-null    float64
 10  Unit Cost       100 non-null    float64
 11  Total Revenue   100 non-null    float64
 12  Total Cost      100 non-null    float64
 13  Total Profit    100 non-null    float64
dtypes: float64(5), int64(2), object(7)
memory usage: 11.1+ KB

In [6]:
sales_data.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

#### It is founded that there are no negative values present in the given dataset

In [7]:
sales_data.isna().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

#### It is found that there are no null values present in the given dataset

## Pre-processing

In [8]:
sales_data['Order Date'] = pd.to_datetime(sales_data['Order Date'])
sales_data['Ship Date'] = pd.to_datetime(sales_data['Ship Date'])

In [9]:
sales_data.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-05-28,669165933,2010-06-27,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-08-22,963881480,2012-09-15,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-05-02,341417157,2014-05-08,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-06-20,514321792,2014-07-05,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-02-01,115456712,2013-02-06,5062,651.21,524.96,3296425.02,2657347.52,639077.50

#### Spilling month, year and monthly_year from Order Date and Ship Date columns

In [10]:
# Spilliting month, year and yearly_month from base column

sales_data.insert(loc=7, column='Order Year_', value=sales_data['Order Date'].dt.year)
sales_data.insert(loc=8, column='Order Month_', value=sales_data['Order Date'].dt.month)
sales_data.insert(loc=9, column='Order Yearly Month_', value=sales_data['Order Date'].dt.to_period('M'))
sales_data.insert(loc=10, column='Ship Year_', value=sales_data['Ship Date'].dt.year)
sales_data.insert(loc=11, column='Ship Month_', value=sales_data['Ship Date'].dt.month)
sales_data.insert(loc=12, column='Ship Yearly Month_', value=sales_data['Ship Date'].dt.to_period('M'))
sales_data.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Order Year_,Order Month_,Order Yearly Month_,Ship Year_,Ship Month_,Ship Yearly Month_,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,2010-05-28,669165933,2010,5,2010-05,2010,6,2010-06,2010-06-27,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,2012-08-22,963881480,2012,8,2012-08,2012,9,2012-09,2012-09-15,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,2014-05-02,341417157,2014,5,2014-05,2014,5,2014-05,2014-05-08,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,2014-06-20,514321792,2014,6,2014-06,2014,7,2014-07,2014-07-05,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2013-02-01,115456712,2013,2,2013-02,2013,2,2013-02,2013-02-06,5062,651.21,524.96,3296425.02,2657347.52,639077.50

## Label encoding

In [11]:
# Label Ecoding the categorical data

label_encoder = LabelEncoder()
sales_data['Region'] = label_encoder.fit_transform(sales_data['Region'])
sales_data['Item Type'] = label_encoder.fit_transform(sales_data['Item Type'])
sales_data['Sales Channel'] = label_encoder.fit_transform(sales_data['Sales Channel'])
sales_data['Order Priority'] = label_encoder.fit_transform(sales_data['Order Priority'])
sales_data.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Order Year_,Order Month_,Order Yearly Month_,Ship Year_,Ship Month_,Ship Yearly Month_,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,1,Tuvalu,0,0,1,2010-05-28,669165933,2010,5,2010-05,2010,6,2010-06,2010-06-27,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,2,Grenada,2,1,0,2012-08-22,963881480,2012,8,2012-08,2012,9,2012-09,2012-09-15,2804,205.70,117.11,576782.80,328376.44,248406.36
2,3,Russia,8,0,2,2014-05-02,341417157,2014,5,2014-05,2014,5,2014-05,2014-05-08,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,6,Sao Tome and Principe,5,1,0,2014-06-20,514321792,2014,6,2014-06,2014,7,2014-07,2014-07-05,8102,9.33,6.92,75591.66,56065.84,19525.82
4,6,Rwanda,8,0,2,2013-02-01,115456712,2013,2,2013-02,2013,2,2013-02,2013-02-06,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [12]:
sales_data.tail()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Order Year_,Order Month_,Order Yearly Month_,Ship Year_,Ship Month_,Ship Yearly Month_,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
95,6,Mali,3,1,3,2011-07-26,512878119,2011,7,2011-07,2011,9,2011-09,2011-09-03,888,109.28,35.84,97040.64,31825.92,65214.72
96,0,Malaysia,5,0,2,2011-11-11,810711038,2011,11,2011-11,2011,12,2011-12,2011-12-28,6267,9.33,6.92,58471.11,43367.64,15103.47
97,6,Sierra Leone,11,0,0,2016-06-01,728815257,2016,6,2016-06,2016,6,2016-06,2016-06-29,1485,154.06,90.93,228779.10,135031.05,93748.05
98,5,Mexico,9,0,3,2015-07-30,559427106,2015,7,2015-07,2015,8,2015-08,2015-08-08,5767,81.73,56.67,471336.91,326815.89,144521.02
99,6,Mozambique,6,0,2,2012-02-10,665095412,2012,2,2012-02,2012,2,2012-02,2012-02-15,5367,668.27,502.54,3586605.09,2697132.18,889472.91